practice-for-ch-rails-first-routes-long-practice-main/hannamisha/app/controllers/artworks_controller.rb

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "banana"], ["updated_at", "2023-05-04 17:25:22.430489"], ["id", 3]]