practice-for-ch-rails-first-routes-long-practice-main/hannamisha/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"hello\""], ["author_id", 2], ["artwork_id", 1], ["created_at", "2023-05-04 21:21:31.528852"], ["updated_at", "2023-05-04 21:21:31.528852"]]
---
    def create
        @comment = Comment.new(comments_params)
        if @comment.save