practice-for-ch-rails-first-routes-long-practice-main/hannamisha/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-04 17:15:51.947187"], ["username", "paulo"], ["id", 5]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)